app/controllers/students_controller.rb

  def create
    # byebug
    @student = Student.create(student_params(:first_name, :last_name))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Vanessa"], ["last_name", "Bayer"], ["created_at", "2020-02-25 05:11:46.585638"], ["updated_at", "2020-02-25 05:11:46.585638"]]

  def update
    @student.update(student_params(:first_name, :last_name))
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Bay"], ["updated_at", "2020-02-25 05:12:10.071440"], ["id", 3]]